Коммандос ( "e1cib/data/Справочник.Webhooks" );
Здесь ();

Нажать ("!ФормаЗаписать");
Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
	Стоп ( "Должна быть ошибка пустого значения в поле" );
КонецЕсли;

Наименование = _.Наименование;
Если ( Наименование <> Неопределено ) тогда
	Установить ( "!Наименование", _.Наименование );
КонецЕсли;

Нажать ("!ФормаЗаписать");
Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
	Стоп ( "Должна быть ошибка пустого значения в поле" );
КонецЕсли;

СекретныйТокен = _.СекретныйТокен;
Если ( СекретныйТокен <> Неопределено ) тогда
	Установить ( "!СекретныйТокен", _.СекретныйТокен );
КонецЕсли;

Нажать ( "!ФормаЗаписать" );
Если ( НайтиСообщения ( "Поле*" ).Количество () > 0 ) Тогда
	Стоп ( "Не должно быть ошибок пустого значения в поле" );
КонецЕсли;

Нажать ("!ФормаЗаписатьИЗакрыть");