Вызвать ( "Общее.Начало" );
ЗакрытьВсе ();

Вызвать ( "Настройки.ОткрытьНастройки" );
Форма = Здесь ( "Проверка подключения к сервисам" );

// Очистим, если поле ранее заполнялось
Если ( Взять ( "!ФормаАдрес" ) <> "" ) Тогда
	Очистить ("!ФормаАдрес");
КонецЕсли;

Попытка

	Нажать("!ФормаПроверить");
	Стоп ( "Отсутствует сообщение об ошибке" );

Исключение

	// Проверим обязательное наличие сообщения об ошибке
	Если ( НайтиСообщения ( "Не указан адрес веб-сервиса*" ).Количество () = 0 ) тогда
	    Стоп ( "Отсутствует сообщение об ошибке" );
	КонецЕсли;

КонецПопытки;

Нажать ( "OK", Forms.Get1C () );

Адрес = __.АдресСервиса;

Здесь (Форма);
Ввести ( "!ФормаАдрес", Адрес );

Закрыть (Форма);

Вызвать ( "Настройки.ОткрытьНастройки" );
Форма = Здесь ( "Проверка подключения к сервисам" );

Проверить ( "!ФормаАдрес", Адрес);

Нажать("!ФормаПроверить");

Пауза (1);

Проверить ("!ФормаРезультат", "Доступны;Выключены");

Стек = Debug.Stack [ Debug.Level ];
Макет = RuntimeSrv.GetSpreadsheet ( стек.Module, стек.IsVersion ).Template;
Эталон = Макет.Область ( 1, 1 ).Текст;

Проверить ("!ФормаJSON", Эталон);