Вызвать ( "Общее.Начало" );
ЗакрытьВсе ();

ИД = "25C555B70";
Тест = Окружение ( ИД );
СоздатьОкружение ( Тест );


// *********************************************
// Вспомогательные процедуры и функции
// *********************************************

Функция Окружение ( ИД )

	Параметры = новый Структура ();
	Параметры.Вставить ( "ИД", ИД );
	Параметры.Вставить ( "ВнешнееХранилище", "ВнешнееХранилище" + ИД );
	Параметры.Вставить ( "СекретныйТокен", "gita" );

	Возврат Параметры;

КонецФункции

Процедура СоздатьОкружение ( Тест )

	ИД = Тест.ИД;

	// *****************************************************
	// Проверяем, нужно ли создавать данные для тестирования
	// *****************************************************

	Если ( СозданоОкружение ( ИД ) ) Тогда
		Возврат;
	КонецЕсли;

	Параметры = Вызвать ( "Справочники.Webhooks.Создать.Параметры" );
	Параметры.Наименование = Тест.ВнешнееХранилище;
	Параметры.СекретныйТокен = Тест.СекретныйТокен;

	Вызвать ( "Справочники.Webhooks.Создать", Параметры );

	// ********************************
	// Регистрируем созданное окружение
	// ********************************

	СохранитьОкружение ( ИД );

КонецПроцедуры