СтандартнаяОбработка = ложь;

Если ( __ = Неопределено ) тогда
	__ = Новый Структура ();
Иначе
	Возврат;
Конецесли;

// *************************************************************************
// Используем переменную "__" для задания произвольных глобальных параметров
// *************************************************************************

__.Вставить ( "АдресСервиса", "http://spbcoit58.stdp.ru/api/hs/gitlab" );
//__.Вставить ( "ЛокальнаяВалюта", "РУБ" );

//если ( ИмяПриложения = "УТ11" ) тогда
//	__.Вставить ( "Организация", "Торговый дом ""Комплексный""" );
//конецесли;

// ***********************************************
// Выполняем подключение к тестируемому приложению
// ***********************************************

Подключить ();